---
layout:     post
title:      进程与线程 -- 线程切换（二）
subtitle:   c++
date:       2021-5-28
author:     YiMiTuMi
header-img: 
catalog: true
tags:
    - windows
---

# 进程与线程 -- 线程切换（二）

[3环模拟Windows线程切换](http://yimitumi.com/2021/05/31/3%E7%8E%AF%E6%A8%A1%E6%8B%9F%E7%BA%BF%E7%A8%8B%E5%88%87%E6%8D%A2/)

一个线程执行至少需要**寄存器**和**堆栈**，线程切换本质就是堆栈的切换。

线程切换分为两种：主动切换和被动切换。只要调用API就会发生主动切换，系统时钟属于被动切换。

每一个线程最开始执行的总是同一个StartUp（开始函数），然后在 StartUp 中调用自己的执行函数。

**中断一个正在执行的程序：**

1）异常：缺页，或者 INT N 指令

2）中断：时钟中断


**线程切换的几种情况：**

1）主动调用API函数

2）时钟中断

3）异常处理

如果一个线程不调用API，在代码中屏蔽钟中断（CLI指令），并且不会出现异常，那么当前线程将永久占用CPU，单核占有率100%，双核就是50%。

## 线程切换与TSS的关系

**内核堆栈：**

	StackLimit	→	          0000
					  0000
					  0000
					  0000
	InitialStack →	                  0000
					  0000
					  0000
					  0000
					  0000
					  0000
	InitialStack →	                  0000

InitialStack 栈底

KernelStack  栈顶

StackLimit   栈的边界  （这三个成员存储在_KTHREAD结构体中）


**内核堆栈的结构：**

内核堆栈有2部分组成，即 InitialStack + 0x210字节 和 _Trap_Frame结构组成
	
	StackLimit	→  0000
			   0000
	InitialStack →	   0000
		           0000
			   0000
			   0000
			   0000
	0x210	→	   0000   ↑ _Trap_Frame结构
		           0000
			   0000
	InitialStack →	   0000   ↑ 0x210字节 （浮点寄存器的值）


**调用API进0环：**

普通调用：通过 Tss.Esp0 得到0环堆栈

快速调用：从MSR得到一个临时0环栈，代码执行后仍然通过 Tss.Esp0 得到当前线程0环堆栈

**TSS：**

Inter设计TSS的目的是为了任务切换（线程切换），但Windows与Linux并没有使用，而是采用堆栈来保存线程的各种寄存器。

在线程切换时，会修改TSS中的 CR3 和 Esp0。


	                 jz      loc_404949
	                 call    @WmiTraceContextSwap@8 ; WmiTraceContextSwap(x,x)
	                 jmp     loc_404949
	 ; ---------------------------------------------------------------------------
	
	 loc_404A70:                             ; CODE XREF: SwapContext+12↑j
	                 push    0B8h            ; BugCheckCode
	                 call    _KeBugCheck@4   ; KeBugCheck(x)
	SwapContext     endp


**流程：**

若线程A和C线程调用函数，A的线程函数y和C的线程函数n：

	A -> y.SwapContext(发生线程切换，切换到C)-> C(y.SwapContext retu到C线程所调用的函数N) -> n.SwapContext(发生线程切换，切换回到A) 此时A线程会接着y.SwapContext继续执行。 

也就说当A线程调用y函数时，在y函数中发生线程切换，切换到C线程，此时A线程的 **SwapContext** 函数将会直接 **Retu** 到C线程的函数n中开始执行（因为堆栈换了，当前堆栈已经切换到C线程的堆栈了，Retu指令pop出来的返回地址已经变成C线程堆栈中函数n的地址了），当在n函数中发生线程切换，切换回到A线程，此时将会直接Retu到A进程上次执行的位置（此时的堆栈已经从C线程切换到A线程了），即接着 SwapContext 向后继续运行。**即 Retu 返回的地址是不固定的主要看要切换线程的堆栈中返回地址的值。**


						          设置新线程状态为运行
								   ↓
					        将当前线程的异常链表保存到自己的堆栈
								   ↓
				                      将新线程的调试状态写入 KPCR 
							           ↓
						       保存堆栈将当前线程的ESP0 
								   ↓
	                                更新KPCR中线程堆栈信息为要切换线程信息（起始堆栈、堆栈范围）
								   ↓
		                                       将新线程的 ESP0 保存到TSS中
								   ↓
	        将新线程的ESP0赋值给ESP，即现在ESP指向的是新线程的堆栈，完成线程切换 注：从现在开始向下堆栈已经切换成新的线程的了
								   ↓
					              将新线程的 TEB 写入到KPCR中
					                           ↓
		                       比较两个线程是否所在同一个进程中，不在则切换进程，即切换CR3，否则切换  →   →  →  →   → 
								   ↓
								   ↓Y(不在同一进程)                                        ↓   N（在同一进程）              
								   ↓
						      获取新进程的页目录表基址(CR3)                                        ↓
								   ↓
					                 获取新线程的IopmOffset                                            ↓
								   ↓
					            将新进程CR3保存到TSS中存储CR3的位置                                    ↓
								   ↓
					            将新进程的CR3 写到 CR3寄存器中  （切换CR3）                            ↓
								   ↓
				                 将IopmOffset的值写入到TSS的IoMapBase位置                                  ↓
								   ↓
								   ↓  ←  ←     ←      ←   ←    ←   ←     ←    ←   ←    ←        
								   ↓
						       获取KPCR 中 _NT_TIB 结构体指针
							           ↓	
						             获取KPCR中 GDT表
								   ↓
	                               重写FS寄存器段描述符中的Base值，使其指向TEB（即三环的FS:[0]）
								   ↓
					            从新堆栈中将异常链表保存到KPCR中
								   ↓
	          Retn （注意Retn 并不会返回到KiSwapContext，返回的地址是不固定的主要看要切换线程的堆栈中返回地址的值，EIP）


## 总结：


线程就是:EIP,EIP在哪哪就是线程。

线程切换就是:ESp

进程就是:CR3

访问内存如果发生缺页，就会进入缺页异常处理函数，发生线程切换。

寄存器FS和GS是段寄存器。 它们没有处理器定义的目的，而是由操作系统运行它们来实现目的。 在Windows 64位中，GS寄存器用于指向操作系统定义的结构。 OS内核通常使用FS和GS来访问特定于线程的内存。 在Windows中，GS寄存器用于管理特定于线程的内存, 通常用作指向线程本地存储（TLS）的指针。。 linux内核使用GS来访问特定于CPU的内存。

正常情况下，当前线程使用的CR3是由其所属进程提供的，正是因为如此，A进程中的线程只能访问A的内存。如果要让A进程中的线程能够访问B进程的内存，就必须要修改CR3的值为B进程的页目录表基址，这就是所谓的“进程挂靠”。


## 备注：XP中_ETHREAD _KTHREAD KPCR KPCRB _NT_TIB TSS _KAPC_STATE结构体

_KPCR：

	kd> dt _KPCR
	nt!_KPCR
	   +0x000 NtTib            : _NT_TIB
	   +0x01c SelfPcr          : Ptr32 _KPCR
	   +0x020 Prcb             : Ptr32 _KPRCB
	   +0x024 Irql             : UChar
	   +0x028 IRR              : Uint4B
	   +0x02c IrrActive        : Uint4B
	   +0x030 IDR              : Uint4B
	   +0x034 KdVersionBlock   : Ptr32 Void
	   +0x038 IDT              : Ptr32 _KIDTENTRY
	   +0x03c GDT              : Ptr32 _KGDTENTRY
	   +0x040 TSS              : Ptr32 _KTSS
	   +0x044 MajorVersion     : Uint2B
	   +0x046 MinorVersion     : Uint2B
	   +0x048 SetMember        : Uint4B
	   +0x04c StallScaleFactor : Uint4B
	   +0x050 DebugActive      : UChar
	   +0x051 Number           : UChar
	   +0x052 Spare0           : UChar
	   +0x053 SecondLevelCacheAssociativity : UChar
	   +0x054 VdmAlert         : Uint4B
	   +0x058 KernelReserved   : [14] Uint4B
	   +0x090 SecondLevelCacheSize : Uint4B
	   +0x094 HalReserved      : [16] Uint4B
	   +0x0d4 InterruptMode    : Uint4B
	   +0x0d8 Spare1           : UChar
	   +0x0dc KernelReserved2  : [17] Uint4B
	   +0x120 PrcbData         : _KPRCB

_KPRCB：

	kd> dt _KPRCB
	ntdll!_KPRCB
	   +0x000 MinorVersion     : Uint2B
	   +0x002 MajorVersion     : Uint2B
	   +0x004 CurrentThread    : Ptr32 _KTHREAD
	   +0x008 NextThread       : Ptr32 _KTHREAD
	   +0x00c IdleThread       : Ptr32 _KTHREAD
	   +0x010 Number           : Char
	   +0x011 Reserved         : Char
	   +0x012 BuildType        : Uint2B
	   +0x014 SetMember        : Uint4B
	   +0x018 CpuType          : Char
	   +0x019 CpuID            : Char
	   +0x01a CpuStep          : Uint2B
	   +0x01c ProcessorState   : _KPROCESSOR_STATE
	   +0x33c KernelReserved   : [16] Uint4B
	   +0x37c HalReserved      : [16] Uint4B
	   +0x3bc PrcbPad0         : [92] UChar
	   +0x418 LockQueue        : [16] _KSPIN_LOCK_QUEUE
	   +0x498 PrcbPad1         : [8] UChar
	   +0x4a0 NpxThread        : Ptr32 _KTHREAD
	   +0x4a4 InterruptCount   : Uint4B
	   +0x4a8 KernelTime       : Uint4B
	   +0x4ac UserTime         : Uint4B
	   +0x4b0 DpcTime          : Uint4B
	   +0x4b4 DebugDpcTime     : Uint4B
	   +0x4b8 InterruptTime    : Uint4B
	   +0x4bc AdjustDpcThreshold : Uint4B
	   +0x4c0 PageColor        : Uint4B
	   +0x4c4 SkipTick         : Uint4B
	   +0x4c8 MultiThreadSetBusy : UChar
	   +0x4c9 Spare2           : [3] UChar
	   +0x4cc ParentNode       : Ptr32 _KNODE
	   +0x4d0 MultiThreadProcessorSet : Uint4B
	   +0x4d4 MultiThreadSetMaster : Ptr32 _KPRCB
	   +0x4d8 ThreadStartCount : [2] Uint4B
	   +0x4e0 CcFastReadNoWait : Uint4B
	   +0x4e4 CcFastReadWait   : Uint4B
	   +0x4e8 CcFastReadNotPossible : Uint4B
	   +0x4ec CcCopyReadNoWait : Uint4B
	   +0x4f0 CcCopyReadWait   : Uint4B
	   +0x4f4 CcCopyReadNoWaitMiss : Uint4B
	   +0x4f8 KeAlignmentFixupCount : Uint4B
	   +0x4fc KeContextSwitches : Uint4B
	   +0x500 KeDcacheFlushCount : Uint4B
	   +0x504 KeExceptionDispatchCount : Uint4B
	   +0x508 KeFirstLevelTbFills : Uint4B
	   +0x50c KeFloatingEmulationCount : Uint4B
	   +0x510 KeIcacheFlushCount : Uint4B
	   +0x514 KeSecondLevelTbFills : Uint4B
	   +0x518 KeSystemCalls    : Uint4B
	   +0x51c SpareCounter0    : [1] Uint4B
	   +0x520 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
	   +0x5a0 PPNPagedLookasideList : [32] _PP_LOOKASIDE_LIST
	   +0x6a0 PPPagedLookasideList : [32] _PP_LOOKASIDE_LIST
	   +0x7a0 PacketBarrier    : Uint4B
	   +0x7a4 ReverseStall     : Uint4B
	   +0x7a8 IpiFrame         : Ptr32 Void
	   +0x7ac PrcbPad2         : [52] UChar
	   +0x7e0 CurrentPacket    : [3] Ptr32 Void
	   +0x7ec TargetSet        : Uint4B
	   +0x7f0 WorkerRoutine    : Ptr32     void 
	   +0x7f4 IpiFrozen        : Uint4B
	   +0x7f8 PrcbPad3         : [40] UChar
	   +0x820 RequestSummary   : Uint4B
	   +0x824 SignalDone       : Ptr32 _KPRCB
	   +0x828 PrcbPad4         : [56] UChar
	   +0x860 DpcListHead      : _LIST_ENTRY
	   +0x868 DpcStack         : Ptr32 Void
	   +0x86c DpcCount         : Uint4B
	   +0x870 DpcQueueDepth    : Uint4B
	   +0x874 DpcRoutineActive : Uint4B
	   +0x878 DpcInterruptRequested : Uint4B
	   +0x87c DpcLastCount     : Uint4B
	   +0x880 DpcRequestRate   : Uint4B
	   +0x884 MaximumDpcQueueDepth : Uint4B
	   +0x888 MinimumDpcRate   : Uint4B
	   +0x88c QuantumEnd       : Uint4B
	   +0x890 PrcbPad5         : [16] UChar
	   +0x8a0 DpcLock          : Uint4B
	   +0x8a4 PrcbPad6         : [28] UChar
	   +0x8c0 CallDpc          : _KDPC
	   +0x8e0 ChainedInterruptList : Ptr32 Void
	   +0x8e4 LookasideIrpFloat : Int4B
	   +0x8e8 SpareFields0     : [6] Uint4B
	   +0x900 VendorString     : [13] UChar
	   +0x90d InitialApicId    : UChar
	   +0x90e LogicalProcessorsPerPhysicalProcessor : UChar
	   +0x910 MHz              : Uint4B
	   +0x914 FeatureBits      : Uint4B
	   +0x918 UpdateSignature  : _LARGE_INTEGER
	   +0x920 NpxSaveArea      : _FX_SAVE_AREA
	   +0xb30 PowerState       : _PROCESSOR_POWER_STATE

_KTHREAD：

	kd> dt _KTHREAD
	ntdll!_KTHREAD
	   +0x000 Header           : _DISPATCHER_HEADER
	   +0x010 MutantListHead   : _LIST_ENTRY
	   +0x018 InitialStack     : Ptr32 Void
	   +0x01c StackLimit       : Ptr32 Void
	   +0x020 Teb              : Ptr32 Void
	   +0x024 TlsArray         : Ptr32 Void
	   +0x028 KernelStack      : Ptr32 Void
	   +0x02c DebugActive      : UChar
	   +0x02d State            : UChar
	   +0x02e Alerted          : [2] UChar
	   +0x030 Iopl             : UChar
	   +0x031 NpxState         : UChar
	   +0x032 Saturation       : Char
	   +0x033 Priority         : Char
	   +0x034 ApcState         : _KAPC_STATE
	   +0x04c ContextSwitches  : Uint4B
	   +0x050 IdleSwapBlock    : UChar
	   +0x051 Spare0           : [3] UChar
	   +0x054 WaitStatus       : Int4B
	   +0x058 WaitIrql         : UChar
	   +0x059 WaitMode         : Char
	   +0x05a WaitNext         : UChar
	   +0x05b WaitReason       : UChar
	   +0x05c WaitBlockList    : Ptr32 _KWAIT_BLOCK
	   +0x060 WaitListEntry    : _LIST_ENTRY
	   +0x060 SwapListEntry    : _SINGLE_LIST_ENTRY
	   +0x068 WaitTime         : Uint4B
	   +0x06c BasePriority     : Char
	   +0x06d DecrementCount   : UChar
	   +0x06e PriorityDecrement : Char
	   +0x06f Quantum          : Char
	   +0x070 WaitBlock        : [4] _KWAIT_BLOCK
	   +0x0d0 LegoData         : Ptr32 Void
	   +0x0d4 KernelApcDisable : Uint4B
	   +0x0d8 UserAffinity     : Uint4B
	   +0x0dc SystemAffinityActive : UChar
	   +0x0dd PowerState       : UChar
	   +0x0de NpxIrql          : UChar
	   +0x0df InitialNode      : UChar
	   +0x0e0 ServiceTable     : Ptr32 Void
	   +0x0e4 Queue            : Ptr32 _KQUEUE
	   +0x0e8 ApcQueueLock     : Uint4B
	   +0x0f0 Timer            : _KTIMER
	   +0x118 QueueListEntry   : _LIST_ENTRY
	   +0x120 SoftAffinity     : Uint4B
	   +0x124 Affinity         : Uint4B
	   +0x128 Preempted        : UChar
	   +0x129 ProcessReadyQueue : UChar
	   +0x12a KernelStackResident : UChar
	   +0x12b NextProcessor    : UChar
	   +0x12c CallbackStack    : Ptr32 Void
	   +0x130 Win32Thread      : Ptr32 Void
	   +0x134 TrapFrame        : Ptr32 _KTRAP_FRAME
	   +0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
	   +0x140 PreviousMode     : Char
	   +0x141 EnableStackSwap  : UChar
	   +0x142 LargeStack       : UChar
	   +0x143 ResourceIndex    : UChar
	   +0x144 KernelTime       : Uint4B
	   +0x148 UserTime         : Uint4B
	   +0x14c SavedApcState    : _KAPC_STATE
	   +0x164 Alertable        : UChar
	   +0x165 ApcStateIndex    : UChar
	   +0x166 ApcQueueable     : UChar
	   +0x167 AutoAlignment    : UChar
	   +0x168 StackBase        : Ptr32 Void
	   +0x16c SuspendApc       : _KAPC
	   +0x19c SuspendSemaphore : _KSEMAPHORE
	   +0x1b0 ThreadListEntry  : _LIST_ENTRY
	   +0x1b8 FreezeCount      : Char
	   +0x1b9 SuspendCount     : Char
	   +0x1ba IdealProcessor   : UChar
	   +0x1bb DisableBoost     : UChar

_ETHREAD：

	kd> dt _ETHREAD
	ntdll!_ETHREAD
	   +0x000 Tcb              : _KTHREAD
	   +0x1c0 CreateTime       : _LARGE_INTEGER
	   +0x1c0 NestedFaultCount : Pos 0, 2 Bits
	   +0x1c0 ApcNeeded        : Pos 2, 1 Bit
	   +0x1c8 ExitTime         : _LARGE_INTEGER
	   +0x1c8 LpcReplyChain    : _LIST_ENTRY
	   +0x1c8 KeyedWaitChain   : _LIST_ENTRY
	   +0x1d0 ExitStatus       : Int4B
	   +0x1d0 OfsChain         : Ptr32 Void
	   +0x1d4 PostBlockList    : _LIST_ENTRY
	   +0x1dc TerminationPort  : Ptr32 _TERMINATION_PORT
	   +0x1dc ReaperLink       : Ptr32 _ETHREAD
	   +0x1dc KeyedWaitValue   : Ptr32 Void
	   +0x1e0 ActiveTimerListLock : Uint4B
	   +0x1e4 ActiveTimerListHead : _LIST_ENTRY
	   +0x1ec Cid              : _CLIENT_ID
	   +0x1f4 LpcReplySemaphore : _KSEMAPHORE
	   +0x1f4 KeyedWaitSemaphore : _KSEMAPHORE
	   +0x208 LpcReplyMessage  : Ptr32 Void
	   +0x208 LpcWaitingOnPort : Ptr32 Void
	   +0x20c ImpersonationInfo : Ptr32 _PS_IMPERSONATION_INFORMATION
	   +0x210 IrpList          : _LIST_ENTRY
	   +0x218 TopLevelIrp      : Uint4B
	   +0x21c DeviceToVerify   : Ptr32 _DEVICE_OBJECT
	   +0x220 ThreadsProcess   : Ptr32 _EPROCESS
	   +0x224 StartAddress     : Ptr32 Void
	   +0x228 Win32StartAddress : Ptr32 Void
	   +0x228 LpcReceivedMessageId : Uint4B
	   +0x22c ThreadListEntry  : _LIST_ENTRY
	   +0x234 RundownProtect   : _EX_RUNDOWN_REF
	   +0x238 ThreadLock       : _EX_PUSH_LOCK
	   +0x23c LpcReplyMessageId : Uint4B
	   +0x240 ReadClusterSize  : Uint4B
	   +0x244 GrantedAccess    : Uint4B
	   +0x248 CrossThreadFlags : Uint4B
	   +0x248 Terminated       : Pos 0, 1 Bit
	   +0x248 DeadThread       : Pos 1, 1 Bit
	   +0x248 HideFromDebugger : Pos 2, 1 Bit
	   +0x248 ActiveImpersonationInfo : Pos 3, 1 Bit
	   +0x248 SystemThread     : Pos 4, 1 Bit
	   +0x248 HardErrorsAreDisabled : Pos 5, 1 Bit
	   +0x248 BreakOnTermination : Pos 6, 1 Bit
	   +0x248 SkipCreationMsg  : Pos 7, 1 Bit
	   +0x248 SkipTerminationMsg : Pos 8, 1 Bit
	   +0x24c SameThreadPassiveFlags : Uint4B
	   +0x24c ActiveExWorker   : Pos 0, 1 Bit
	   +0x24c ExWorkerCanWaitUser : Pos 1, 1 Bit
	   +0x24c MemoryMaker      : Pos 2, 1 Bit
	   +0x250 SameThreadApcFlags : Uint4B
	   +0x250 LpcReceivedMsgIdValid : Pos 0, 1 Bit
	   +0x250 LpcExitThreadCalled : Pos 1, 1 Bit
	   +0x250 AddressSpaceOwner : Pos 2, 1 Bit
	   +0x254 ForwardClusterOnly : UChar
	   +0x255 DisablePageFaultClustering : UChar

_NT_TIB:
	
	kd> dt _NT_TIB
	ntdll!_NT_TIB
	   +0x000 ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD
	   +0x004 StackBase        : Ptr32 Void
	   +0x008 StackLimit       : Ptr32 Void
	   +0x00c SubSystemTib     : Ptr32 Void
	   +0x010 FiberData        : Ptr32 Void
	   +0x010 Version          : Uint4B
	   +0x014 ArbitraryUserPointer : Ptr32 Void
	   +0x018 Self             : Ptr32 _NT_TIB

_KTSS:

	kd> dt _KTSS
	nt!_KTSS
	   +0x000 Backlink         : Uint2B
	   +0x002 Reserved0        : Uint2B
	   +0x004 Esp0             : Uint4B
	   +0x008 Ss0              : Uint2B
	   +0x00a Reserved1        : Uint2B
	   +0x00c NotUsed1         : [4] Uint4B
	   +0x01c CR3              : Uint4B
	   +0x020 Eip              : Uint4B
	   +0x024 EFlags           : Uint4B
	   +0x028 Eax              : Uint4B
	   +0x02c Ecx              : Uint4B
	   +0x030 Edx              : Uint4B
	   +0x034 Ebx              : Uint4B
	   +0x038 Esp              : Uint4B
	   +0x03c Ebp              : Uint4B
	   +0x040 Esi              : Uint4B
	   +0x044 Edi              : Uint4B
	   +0x048 Es               : Uint2B
	   +0x04a Reserved2        : Uint2B
	   +0x04c Cs               : Uint2B
	   +0x04e Reserved3        : Uint2B
	   +0x050 Ss               : Uint2B
	   +0x052 Reserved4        : Uint2B
	   +0x054 Ds               : Uint2B
	   +0x056 Reserved5        : Uint2B
	   +0x058 Fs               : Uint2B
	   +0x05a Reserved6        : Uint2B
	   +0x05c Gs               : Uint2B
	   +0x05e Reserved7        : Uint2B
	   +0x060 LDT              : Uint2B
	   +0x062 Reserved8        : Uint2B
	   +0x064 Flags            : Uint2B
	   +0x066 IoMapBase        : Uint2B
	   +0x068 IoMaps           : [1] _KiIoAccessMap
	   +0x208c IntDirectionMap  : [32] UChar

_KAPC_STATE:

	ntdll!_KAPC_STATE
	   +0x000 ApcListHead      : [2] _LIST_ENTRY
	   +0x010 Process          : Ptr32 _KPROCESS
	   +0x014 KernelApcInProgress : UChar
	   +0x015 KernelApcPending : UChar
	   +0x016 UserApcPending   : UChar



